OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    t += USB_DT_STRING << 8;    /* Now t is first 16 bits to store */

    n = len;
    while (n--) {
        *buf++ = t;
        if (!n--)
            break;
        *buf++ = t >> 8;
        t = (unsigned char)*s++;
    }
    return len;
}

/**
 * rh_string() - provides string descriptors for root hub
 * @id: the string ID number (0: langids, 1: serial #, 2: product, 3: vendor)
 * @hcd: the host controller for this root hub
 * @data: buffer for output packet
 * @len: length of the provided buffer
 *
 * Produces either a manufacturer, product or serial number string for the
 * virtual root hub device.
 * Returns the number of bytes filled in: the length of the descriptor or
 * of the provided buffer, whichever is less.
 */
static unsigned
rh_string(int id, struct usb_hcd const *hcd, u8 *data, unsigned len)
{
    char buf[100];
    char const *s;
    static char const langids[4] = {4, USB_DT_STRING, 0x09, 0x04};

    // language ids
    switch (id) {
    case 0:
        /* Array of LANGID codes (0x0409 is MSFT-speak for "en-us") */
        /* See http://www.usb.org/developers/docs/USB_LANGIDs.pdf */
        if (len > 4)
            len = 4;
        memcpy(data, langids, len);
        return len;
    case 1:
        /* Serial number */
        s = hcd->self.bus_name;
        break;
    case 2:
        /* Product name */
        s = hcd->product_desc;
        break;
    case 3:
        /* Manufacturer */
        //snprintf (buf, sizeof buf, "%s %s %s", init_utsname()->sysname,
        //  init_utsname()->release, hcd->driver->description);
        sprintf(buf, "Nuvoton M480");
        s = buf;
        break;
    default:
        /* Can't happen; caller guarantees it */
        return 0;
    }

    return ascii2desc(s, data, len);
}


/* Root hub control transfers execute synchronously */
static int rh_call_control (struct usb_hcd *hcd, struct urb *urb)
{
    struct usb_ctrlrequest *cmd;
    u16     typeReq, wValue, wIndex, wLength;
    u8      *ubuf = urb->transfer_buffer;
    /*
     * tbuf should be as big as the BOS descriptor and
     * the USB hub descriptor.
     */
    u8      tbuf[USB_DT_BOS_SIZE + USB_DT_USB_SS_CAP_SIZE] ;   // __attribute__((aligned(4)));
    const u8    *bufp = tbuf;
    unsigned    len = 0;
    int     status;
    //u8    patch_wakeup = 0;
    //u8    patch_protocol = 0;

    might_sleep();

    spin_lock_irq(&hcd_root_hub_lock);
    status = usb_hcd_link_urb_to_ep(hcd, urb);
    spin_unlock_irq(&hcd_root_hub_lock);
    if (status)
        return status;
    urb->hcpriv = hcd;  /* Indicate it's queued */
    cmd = (struct usb_ctrlrequest *) urb->setup_packet;
    typeReq  = (cmd->bRequestType << 8) | cmd->bRequest;
    wValue   = le16_to_cpu (cmd->wValue);
    wIndex   = le16_to_cpu (cmd->wIndex);
    wLength  = le16_to_cpu (cmd->wLength);

    if (wLength > urb->transfer_buffer_length)
        goto error;

    urb->actual_length = 0;
    switch (typeReq) {

    /* DEVICE REQUESTS */

    /* The root hub's remote wakeup enable bit is implemented using
     * driver model wakeup flags.  If this system supports wakeup
     * through USB, userspace may change the default "allow wakeup"
     * policy through sysfs or these calls.
     *
     * Most root hubs support wakeup from downstream devices, for
     * runtime power management (disabling USB clocks and reducing
     * VBUS power usage).  However, not all of them do so; silicon,
     * board, and BIOS bugs here are not uncommon, so these can't
     * be treated quite like external hubs.
     *
     * Likewise, not all root hubs will pass wakeup events upstream,
     * to wake up the whole system.  So don't assume root hub and
     * controller capabilities are identical.
     */

    case DeviceRequest | USB_REQ_GET_STATUS:
        tbuf [0] = (1   // device_may_wakeup(&hcd->self.root_hub->dev)
                    << USB_DEVICE_REMOTE_WAKEUP)
                   | (1 << USB_DEVICE_SELF_POWERED);
        tbuf [1] = 0;
        len = 2;
        break;
    case DeviceOutRequest | USB_REQ_CLEAR_FEATURE:
        if (wValue == USB_DEVICE_REMOTE_WAKEUP)
            ; //device_set_wakeup_enable(&hcd->self.root_hub->dev, 0);
        else
            goto error;
        break;
    case DeviceOutRequest | USB_REQ_SET_FEATURE:
        if (1 //device_can_wakeup(&hcd->self.root_hub->dev)
                && wValue == USB_DEVICE_REMOTE_WAKEUP)
            ; //device_set_wakeup_enable(&hcd->self.root_hub->dev, 1);
        else
            goto error;
        break;
    case DeviceRequest | USB_REQ_GET_CONFIGURATION:
        tbuf [0] = 1;
        len = 1;
    /* FALLTHROUGH */
    case DeviceOutRequest | USB_REQ_SET_CONFIGURATION:
        break;
    case DeviceRequest | USB_REQ_GET_DESCRIPTOR:
        switch (wValue & 0xff00) {
        case USB_DT_DEVICE << 8:
            switch (hcd->speed) {
            case HCD_USB3:
                bufp = usb3_rh_dev_descriptor;
                break;
            case HCD_USB2:
                bufp = usb2_rh_dev_descriptor;
                break;
            case HCD_USB11:
                bufp = usb11_rh_dev_descriptor;
                break;
            default:
                goto error;
            }
            len = 18;
            //if (hcd->has_tt)
            //  patch_protocol = 1;
            break;
        case USB_DT_CONFIG << 8:
            switch (hcd->speed) {
            case HCD_USB3:
                bufp = ss_rh_config_descriptor;
                len = sizeof ss_rh_config_descriptor;
                break;
            case HCD_USB2:
                bufp = hs_rh_config_descriptor;
                len = sizeof hs_rh_config_descriptor;
                break;
            case HCD_USB11:
                bufp = fs_rh_config_descriptor;
                len = sizeof fs_rh_config_descriptor;
                break;
            default:
                goto error;
            }
            //if (device_can_wakeup(&hcd->self.root_hub->dev))
            //  patch_wakeup = 1;
            break;
        case USB_DT_STRING << 8:
            if ((wValue & 0xff) < 4)
                urb->actual_length = rh_string(wValue & 0xff,
                                               hcd, ubuf, wLength);
            else /* unsupported IDs --> "protocol stall" */
                goto error;
            break;
        case USB_DT_BOS << 8:
            goto nongeneric;
        default:
            goto error;
        }
        break;
    case DeviceRequest | USB_REQ_GET_INTERFACE:
        tbuf [0] = 0;
        len = 1;
    /* FALLTHROUGH */
    case DeviceOutRequest | USB_REQ_SET_INTERFACE:
        break;
    case DeviceOutRequest | USB_REQ_SET_ADDRESS:
        // wValue == urb->dev->devaddr
        USB_debug("root hub device address %d\n", wValue);
        break;

    /* INTERFACE REQUESTS (no defined feature/status flags) */

