OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    /* ENDPOINT REQUESTS */

    case EndpointRequest | USB_REQ_GET_STATUS:
        // ENDPOINT_HALT flag
        tbuf [0] = 0;
        tbuf [1] = 0;
        len = 2;
    /* FALLTHROUGH */
    case EndpointOutRequest | USB_REQ_CLEAR_FEATURE:
    case EndpointOutRequest | USB_REQ_SET_FEATURE:
        USB_debug("no endpoint features yet\n");
        break;

    /* CLASS REQUESTS (and errors) */

    default:
nongeneric:
        /* non-generic request */
        switch (typeReq) {
        case GetHubStatus:
        case GetPortStatus:
            len = 4;
            break;
        case GetHubDescriptor:
            len = sizeof (struct usb_hub_descriptor);
            break;
        case DeviceRequest | USB_REQ_GET_DESCRIPTOR:
            /* len is returned by hub_control */
            break;
        }
        status = hcd->driver->hub_control (hcd,
                                           typeReq, wValue, wIndex, (char *)tbuf, wLength);
        break;
error:
        /* "protocol stall" on error */
        status = -EPIPE;
    }

    if (status < 0) {
        len = 0;
        if (status != -EPIPE) {
            USB_debug("TRL: TypeReq=0x%x val=0x%x idx=0x%x len=%d ==> %d\n",
                      typeReq, wValue, wIndex, wLength, status);
        }
    } else if (status > 0) {
        /* hub_control may return the length of data copied. */
        len = status;
        status = 0;
    }
    if (len) {
        if (urb->transfer_buffer_length < len)
            len = urb->transfer_buffer_length;
        urb->actual_length = len;
        // always USB_DIR_IN, toward host
        memcpy (ubuf, bufp, len);

        /* report whether RH hardware supports remote wakeup */
        //if (patch_wakeup &&
        //      len > offsetof (struct usb_config_descriptor,
        //              bmAttributes))
        //  ((struct usb_config_descriptor *)ubuf)->bmAttributes
        //      |= USB_CONFIG_ATT_WAKEUP;

        /* report whether RH hardware has an integrated TT */
        //if (patch_protocol &&
        //      len > offsetof(struct usb_device_descriptor,
        //              bDeviceProtocol))
        //  ((struct usb_device_descriptor *) ubuf)->
        //          bDeviceProtocol = 0;  // 1;
    }

    /* any errors get returned through the urb completion */
    spin_lock_irq(&hcd_root_hub_lock);
    usb_hcd_unlink_urb_from_ep(hcd, urb);

    /* This peculiar use of spinlocks echoes what real HC drivers do.
     * Avoiding calls to local_irq_disable/enable makes the code
     * RT-friendly.
     */
    spin_unlock(&hcd_root_hub_lock);
    usb_hcd_giveback_urb(hcd, urb, status);
    spin_lock(&hcd_root_hub_lock);

    spin_unlock_irq(&hcd_root_hub_lock);
    return 0;
}

/*-------------------------------------------------------------------------*/

/*
 * Root Hub interrupt transfers are polled using a timer if the
 * driver requests it; otherwise the driver is responsible for
 * calling usb_hcd_poll_rh_status() when an event occurs.
 *
 * Completions are called in_interrupt(), but they may or may not
 * be in_irq().
 */
void usb_hcd_poll_rh_status(struct usb_hcd *hcd)
{
    struct urb  *urb;
    int         length;
    //unsigned long flags;
    char        buffer[32]; /* Any root hubs with > 31 ports? */

    if (unlikely(!hcd->rh_pollable))
        return;

    if (!hcd->uses_new_polling && !hcd->status_urb)
        return;

    length = hcd->driver->hub_status_data(hcd, buffer);
    if (length > 0) {
        /* try to complete the status urb */
        spin_lock_irqsave(&hcd_root_hub_lock, flags);
        urb = hcd->status_urb;
        if (urb == NULL)
            USB_vdebug("hcd status_urb is NULL!!\n");
        if (urb) {
            clear_bit(HCD_FLAG_POLL_PENDING, &hcd->flags);
            hcd->status_urb = NULL;
            urb->actual_length = length;
            memcpy(urb->transfer_buffer, buffer, length);

            usb_hcd_unlink_urb_from_ep(hcd, urb);
            spin_unlock(&hcd_root_hub_lock);
            usb_hcd_giveback_urb(hcd, urb, 0);
            spin_lock(&hcd_root_hub_lock);
        } else {
            length = 0;
            set_bit(HCD_FLAG_POLL_PENDING, &hcd->flags);
        }
        spin_unlock_irqrestore(&hcd_root_hub_lock, flags);
    }

    /* The USB 2.0 spec says 256 ms.  This is close enough and won't
     * exceed that limit if HZ is 100. The math is more clunky than
     * maybe expected, this is to make sure that all timers for USB devices
     * fire at the same time to give the CPU a break in between */
    //if (hcd->uses_new_polling ? HCD_POLL_RH(hcd) :
    //      (length == 0 && hcd->status_urb != NULL))
    //  mod_timer (&hcd->rh_timer, (jiffies/(HZ/4) + 1) * (HZ/4));
}


#ifdef NUVOTON_PORTED
static struct usb_hcd * _m480_hcd_list[8];
static int  _m480_hcd_count = 0;
void  usb_add_poll_hcd(struct usb_hcd *hcd)
{
    USB_vdebug("usb_add_poll_hcd - 0x%x\n", (int)hcd);
    _m480_hcd_list[_m480_hcd_count] = hcd;
    _m480_hcd_count++;
}
void  usb_poll_root_hubs()
{
    int  i;
    for (i = 0; i < _m480_hcd_count; i++)
        usb_hcd_poll_rh_status(_m480_hcd_list[i]);
}
#else
/* timer callback */
static void rh_timer_func (unsigned long _hcd)
{
    usb_hcd_poll_rh_status((struct usb_hcd *) _hcd);
}
#endif



/*-------------------------------------------------------------------------*/

static int rh_queue_status (struct usb_hcd *hcd, struct urb *urb)
{
    int     retval;
    //unsigned long flags;
    unsigned    len;

    len = 1 + (urb->dev->maxchild / 8);

    spin_lock_irqsave (&hcd_root_hub_lock, flags);
    if (hcd->status_urb || urb->transfer_buffer_length < len) {
        USB_debug("not queuing rh status urb\n");
        retval = -EINVAL;
        goto done;
    }
    retval = usb_hcd_link_urb_to_ep(hcd, urb);
    if (retval)
        goto done;

    hcd->status_urb = urb;
    urb->hcpriv = hcd;  /* indicate it's queued */

    //if (!hcd->uses_new_polling)
    //  mod_timer(&hcd->rh_timer, (jiffies/(HZ/4) + 1) * (HZ/4));
    /* If a status change has already occurred, report it ASAP */
    //else if (HCD_POLL_PENDING(hcd))
    //  mod_timer(&hcd->rh_timer, jiffies);

    retval = 0;
done:
    spin_unlock_irqrestore (&hcd_root_hub_lock, flags);
    return retval;
}

static int rh_urb_enqueue (struct usb_hcd *hcd, struct urb *urb)
{
    if (usb_endpoint_xfer_int(&urb->ep->desc)) {
        return rh_queue_status (hcd, urb);
    }
    if (usb_endpoint_xfer_control(&urb->ep->desc)) {
        return rh_call_control (hcd, urb);
    }
    return -EINVAL;
}

/*-------------------------------------------------------------------------*/

/* Unlinks of root-hub control URBs are legal, but they don't do anything
 * since these URBs always execute synchronously.
 */
static int usb_rh_urb_dequeue(struct usb_hcd *hcd, struct urb *urb, int status)
{
    //unsigned long flags;
    int     rc;

    spin_lock_irqsave(&hcd_root_hub_lock, flags);
    rc = usb_hcd_check_unlink_urb(hcd, urb, status);
    if (rc)
        goto done;

    if (usb_endpoint_num(&urb->ep->desc) == 0) {    /* Control URB */
        ;   /* Do nothing */

