OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    } else {                /* Status URB */
        //if (!hcd->uses_new_polling)
        //  del_timer (&hcd->rh_timer);
        if (urb == hcd->status_urb) {
            hcd->status_urb = NULL;
            usb_hcd_unlink_urb_from_ep(hcd, urb);

            spin_unlock(&hcd_root_hub_lock);
            usb_hcd_giveback_urb(hcd, urb, status);
            spin_lock(&hcd_root_hub_lock);
        }
    }
done:
    spin_unlock_irqrestore(&hcd_root_hub_lock, flags);
    return rc;
}


#if 0
/*
 * Show & store the current value of authorized_default
 */
static ssize_t usb_host_authorized_default_show(struct device *dev,
        struct device_attribute *attr,
        char *buf)
{
    struct usb_device *rh_usb_dev;
    struct usb_bus *usb_bus;
    struct usb_hcd *usb_hcd;

    rh_usb_dev = to_usb_device(dev);
    usb_bus = rh_usb_dev->bus;

    if (usb_bus == NULL)    /* FIXME: not sure if this case is possible */
        return -ENODEV;
    usb_hcd = bus_to_hcd(usb_bus);
    return snprintf(buf, PAGE_SIZE, "%u\n", usb_hcd->authorized_default);
}

static ssize_t usb_host_authorized_default_store(struct device *dev,
        struct device_attribute *attr,
        const char *buf, size_t size)
{
    ssize_t result;
    unsigned val;
    struct usb_device *rh_usb_dev;
    struct usb_bus *usb_bus;
    struct usb_hcd *usb_hcd;

    rh_usb_dev = to_usb_device(dev);
    usb_bus = rh_usb_dev->bus;

    if (usb_bus == NULL)    /* FIXME: not sure if this case is possible */
        return -ENODEV;
    usb_hcd = bus_to_hcd(usb_bus);
    result = sscanf(buf, "%u\n", &val);
    if (result == 1) {
        usb_hcd->authorized_default = val? 1 : 0;
        result = size;
    } else
        result = -EINVAL;
    return result;
}
#endif

#if 0
static DEVICE_ATTR(authorized_default, 0644,
                   usb_host_authorized_default_show,
                   usb_host_authorized_default_store);


/* Group all the USB bus attributes */
static struct attribute *usb_bus_attrs[] = {
    &dev_attr_authorized_default.attr,
    NULL,
};

static struct attribute_group usb_bus_attr_group = {
    .name = NULL,   /* we want them in the same directory */
    .attrs = usb_bus_attrs,
};
#endif


/*-------------------------------------------------------------------------*/

/**
 * usb_bus_init - shared initialization code
 * @bus: the bus structure being initialized
 *
 * This code is used to initialize a usb_bus structure, memory for which is
 * separately managed.
 */
static void usb_bus_init (struct usb_bus *bus)
{
    memset (&bus->devmap, 0, sizeof(struct usb_devmap));

    bus->devnum_next = 1;

    bus->root_hub = NULL;
    bus->busnum = -1;
    bus->bandwidth_allocated = 0;
    bus->bandwidth_int_reqs  = 0;
    bus->bandwidth_isoc_reqs = 0;

    INIT_LIST_HEAD (&bus->bus_list);
}

/*-------------------------------------------------------------------------*/

/**
 * usb_register_bus - registers the USB host controller with the usb core
 * @bus: pointer to the bus to register
 * Context: !in_interrupt()
 *
 * Assigns a bus number, and links the controller into usbcore data
 * structures so that it can be seen by scanning the bus list.
 */
static int usb_register_bus(struct usb_bus *bus)
{
    int result = -E2BIG;
    int busnum;

    mutex_lock(&usb_bus_list_lock);
    busnum = find_next_zero_bit (busmap.busmap, USB_MAXBUS, 1);
    if (busnum >= USB_MAXBUS) {
        USB_error("%s: too many buses\n", usbcore_name);
        goto error_find_busnum;
    }
    set_bit (busnum, busmap.busmap);
    bus->busnum = busnum;

    /* Add it to the local list of buses */
    list_add (&bus->bus_list, &usb_bus_list);
    mutex_unlock(&usb_bus_list_lock);

    //usb_notify_add_bus(bus);

    //dev_info (bus->controller, "new USB bus registered, assigned bus "
    //    "number %d\n", bus->busnum);
    return 0;

error_find_busnum:
    mutex_unlock(&usb_bus_list_lock);
    return result;
}

/**
 * usb_deregister_bus - deregisters the USB host controller
 * @bus: pointer to the bus to deregister
 * Context: !in_interrupt()
 *
 * Recycles the bus number, and unlinks the controller from usbcore data
 * structures so that it won't be seen by scanning the bus list.
 */
static void usb_deregister_bus (struct usb_bus *bus)
{
    //dev_info (bus->controller, "USB bus %d deregistered\n", bus->busnum);

    /*
     * NOTE: make sure that all the devices are removed by the
     * controller code, as well as having it call this when cleaning
     * itself up
     */
    mutex_lock(&usb_bus_list_lock);
    list_del (&bus->bus_list);
    mutex_unlock(&usb_bus_list_lock);

    //usb_notify_remove_bus(bus);

    clear_bit (bus->busnum, busmap.busmap);
}

/**
 * register_root_hub - called by usb_add_hcd() to register a root hub
 * @hcd: host controller for this root hub
 *
 * This function registers the root hub with the USB subsystem.  It sets up
 * the device properly in the device tree and then calls usb_new_device()
 * to register the usb device.  It also assigns the root hub's USB address
 * (always 1).
 */
static int register_root_hub(struct usb_hcd *hcd)
{
    //struct device *parent_dev = hcd->self.controller;
    struct usb_device *usb_dev;
    const int devnum = 1;
    int retval;

    usb_dev = hcd->self.root_hub;

    usb_dev->devnum = devnum;
    usb_dev->bus->devnum_next = devnum + 1;
    memset (&usb_dev->bus->devmap.devicemap, 0,
            sizeof usb_dev->bus->devmap.devicemap);
    set_bit (devnum, usb_dev->bus->devmap.devicemap);
    usb_set_device_state(usb_dev, USB_STATE_ADDRESS);

    mutex_lock(&usb_bus_list_lock);

    usb_dev->ep0.desc.wMaxPacketSize = cpu_to_le16(64);

    retval = usb_get_device_descriptor(usb_dev, USB_DT_DEVICE_SIZE);
    if (retval != sizeof usb_dev->descriptor) {
        mutex_unlock(&usb_bus_list_lock);
        USB_debug("can't read device descriptor %d\n", retval);
        return (retval < 0) ? retval : -EMSGSIZE;
    }

    retval = usb_new_device (usb_dev);
    if (retval) {
        USB_error("can't register root hub - %d\n", retval);
    }
    mutex_unlock(&usb_bus_list_lock);

    if (retval == 0) {
        spin_lock_irq (&hcd_root_hub_lock);
        hcd->rh_registered = 1;
        spin_unlock_irq (&hcd_root_hub_lock);

        /* Did the HC die before the root hub was registered? */
        if (HCD_DEAD(hcd))
            usb_hc_died (hcd);  /* This time clean up */
    }

    return retval;
}


/*-------------------------------------------------------------------------*/

/**
 * usb_calc_bus_time - approximate periodic transaction time in nanoseconds
 * @speed: from dev->speed; USB_SPEED_{LOW,FULL,HIGH}
 * @is_input: true iff the transaction sends data to the host
 * @isoc: true for isochronous transactions, false for interrupt ones
 * @bytecount: how many bytes in the transaction.
 *
 * Returns approximate bus time in nanoseconds for a periodic transaction.
 * See USB 2.0 spec section 5.11.3; only periodic transfers need to be
 * scheduled in software, this function is only used for such scheduling.
 */
long usb_calc_bus_time (int speed, int is_input, int isoc, int bytecount)
{
    unsigned long   tmp;

