OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    switch (speed) {
    case USB_SPEED_LOW:     /* INTR only */
        if (is_input) {
            tmp = (67667L * (31L + 10L * BitTime (bytecount))) / 1000L;
            return (64060L + (2 * BW_HUB_LS_SETUP) + BW_HOST_DELAY + tmp);
        } else {
            tmp = (66700L * (31L + 10L * BitTime (bytecount))) / 1000L;
            return (64107L + (2 * BW_HUB_LS_SETUP) + BW_HOST_DELAY + tmp);
        }
    case USB_SPEED_FULL:    /* ISOC or INTR */
        if (isoc) {
            tmp = (8354L * (31L + 10L * BitTime (bytecount))) / 1000L;
            return (((is_input) ? 7268L : 6265L) + BW_HOST_DELAY + tmp);
        } else {
            tmp = (8354L * (31L + 10L * BitTime (bytecount))) / 1000L;
            return (9107L + BW_HOST_DELAY + tmp);
        }
    case USB_SPEED_HIGH:    /* ISOC or INTR */
        // FIXME adjust for input vs output
        if (isoc)
            tmp = HS_NSECS_ISO (bytecount);
        else
            tmp = HS_NSECS (bytecount);
        return tmp;
    default:
        USB_debug ("%s: bogus device speed!\n", usbcore_name);
        return -1;
    }
}


/*-------------------------------------------------------------------------*/

/*
 * Generic HC operations.
 */

/*-------------------------------------------------------------------------*/

/**
 * usb_hcd_link_urb_to_ep - add an URB to its endpoint queue
 * @hcd: host controller to which @urb was submitted
 * @urb: URB being submitted
 *
 * Host controller drivers should call this routine in their enqueue()
 * method.  The HCD's private spinlock must be held and interrupts must
 * be disabled.  The actions carried out here are required for URB
 * submission, as well as for endpoint shutdown and for usb_kill_urb.
 *
 * Returns 0 for no error, otherwise a negative error code (in which case
 * the enqueue() method must fail).  If no error occurs but enqueue() fails
 * anyway, it must call usb_hcd_unlink_urb_from_ep() before releasing
 * the private spinlock and returning.
 */
int usb_hcd_link_urb_to_ep(struct usb_hcd *hcd, struct urb *urb)
{
    int     rc = 0;

    spin_lock(&hcd_urb_list_lock);

    /* Check that the URB isn't being killed */
    if (unlikely(atomic_read(&urb->reject))) {
        rc = -EPERM;
        goto done;
    }

#ifndef NUVOTON_PORTED  // this may cause usb_set_interface() failed ??? 
    if (unlikely(!urb->ep->enabled)) {
        rc = -ENOENT;
        goto done;
    }
#endif

    if (unlikely(!urb->dev->can_submit)) {
        rc = -EHOSTUNREACH;
        goto done;
    }

    /*
     * Check the host controller's state and add the URB to the
     * endpoint's queue.
     */
    if (HCD_RH_RUNNING(hcd)) {
        urb->unlinked = 0;
        list_add_tail(&urb->urb_list, &urb->ep->urb_list);
    } else {
        rc = -ESHUTDOWN;
        goto done;
    }
done:
    spin_unlock(&hcd_urb_list_lock);
    return rc;
}

/**
 * usb_hcd_check_unlink_urb - check whether an URB may be unlinked
 * @hcd: host controller to which @urb was submitted
 * @urb: URB being checked for unlinkability
 * @status: error code to store in @urb if the unlink succeeds
 *
 * Host controller drivers should call this routine in their dequeue()
 * method.  The HCD's private spinlock must be held and interrupts must
 * be disabled.  The actions carried out here are required for making
 * sure than an unlink is valid.
 *
 * Returns 0 for no error, otherwise a negative error code (in which case
 * the dequeue() method must fail).  The possible error codes are:
 *
 *  -EIDRM: @urb was not submitted or has already completed.
 *      The completion function may not have been called yet.
 *
 *  -EBUSY: @urb has already been unlinked.
 */
int usb_hcd_check_unlink_urb(struct usb_hcd *hcd, struct urb *urb,
                             int status)
{
    struct list_head    *tmp;

    /* insist the urb is still queued */
    list_for_each(tmp, &urb->ep->urb_list) {
        if (tmp == &urb->urb_list)
            break;
    }
    if (tmp != &urb->urb_list)
        return -EIDRM;

    /* Any status except -EINPROGRESS means something already started to
     * unlink this URB from the hardware.  So there's no more work to do.
     */
    if (urb->unlinked)
        return -EBUSY;
    urb->unlinked = status;

    /* IRQ setup can easily be broken so that USB controllers
     * never get completion IRQs ... maybe even the ones we need to
     * finish unlinking the initial failed usb_set_address()
     * or device descriptor fetch.
     */
    //if (!HCD_SAW_IRQ(hcd) && !is_root_hub(urb->dev)) {
    //  USB_error("Unlink after no-IRQ? Controller is probably using the wrong IRQ.\n");
    //  set_bit(HCD_FLAG_SAW_IRQ, &hcd->flags);
    //  if (hcd->shared_hcd)
    //      set_bit(HCD_FLAG_SAW_IRQ, &hcd->shared_hcd->flags);
    //}

    return 0;
}

/**
 * usb_hcd_unlink_urb_from_ep - remove an URB from its endpoint queue
 * @hcd: host controller to which @urb was submitted
 * @urb: URB being unlinked
 *
 * Host controller drivers should call this routine before calling
 * usb_hcd_giveback_urb().  The HCD's private spinlock must be held and
 * interrupts must be disabled.  The actions carried out here are required
 * for URB completion.
 */
void usb_hcd_unlink_urb_from_ep(struct usb_hcd *hcd, struct urb *urb)
{
    /* clear all state linking urb to this dev (and hcd) */
    spin_lock(&hcd_urb_list_lock);
    list_del_init(&urb->urb_list);
    spin_unlock(&hcd_urb_list_lock);
}

#if 1   // Nuvoton: urb transfer buffer is DMA and non-cached

static int map_urb_for_dma(struct usb_hcd *hcd, struct urb *urb,
                           gfp_t mem_flags)
{
    urb->transfer_dma = (dma_addr_t)urb->transfer_buffer;
    urb->setup_dma = (dma_addr_t)urb->setup_packet;
    return 0;
}

static void unmap_urb_for_dma(struct usb_hcd *hcd, struct urb *urb)
{
}

#else

/*
 * Some usb host controllers can only perform dma using a small SRAM area.
 * The usb core itself is however optimized for host controllers that can dma
 * using regular system memory - like pci devices doing bus mastering.
 *
 * To support host controllers with limited dma capabilites we provide dma
 * bounce buffers. This feature can be enabled using the HCD_LOCAL_MEM flag.
 * For this to work properly the host controller code must first use the
 * function dma_declare_coherent_memory() to point out which memory area
 * that should be used for dma allocations.
 *
 * The HCD_LOCAL_MEM flag then tells the usb code to allocate all data for
 * dma using dma_alloc_coherent() which in turn allocates from the memory
 * area pointed out with dma_declare_coherent_memory().
 *
 * So, to summarize...
 *
 * - We need "local" memory, canonical example being
 *   a small SRAM on a discrete controller being the
 *   only memory that the controller can read ...
 *   (a) "normal" kernel memory is no good, and
 *   (b) there's not enough to share
 *
 * - The only *portable* hook for such stuff in the
 *   DMA framework is dma_declare_coherent_memory()
 *
 * - So we use that, even though the primary requirement
 *   is that the memory be "local" (hence addressible
 *   by that device), not "coherent".
 *
 */

static int hcd_alloc_coherent(struct usb_bus *bus,
                              gfp_t mem_flags, dma_addr_t *dma_handle,
                              void **vaddr_handle, size_t size,
                              enum dma_data_direction dir)
{
    unsigned char *vaddr;

    if (*vaddr_handle == NULL) {
        WARN_ON_ONCE(1);
        return -EFAULT;
    }

    vaddr = hcd_buffer_alloc(bus, size + sizeof(vaddr),
                             mem_flags, dma_handle);
    if (!vaddr)
        return -ENOMEM;

