OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    /*
     * Store the virtual address of the buffer at the end
     * of the allocated dma buffer. The size of the buffer
     * may be uneven so use unaligned functions instead
     * of just rounding up. It makes sense to optimize for
     * memory footprint over access speed since the amount
     * of memory available for dma may be limited.
     */
    put_unaligned((unsigned long)*vaddr_handle,
                  (unsigned long *)(vaddr + size));

    if (dir == DMA_TO_DEVICE)
        memcpy(vaddr, *vaddr_handle, size);

    *vaddr_handle = vaddr;
    return 0;
}

static void hcd_free_coherent(struct usb_bus *bus, dma_addr_t *dma_handle,
                              void **vaddr_handle, size_t size,
                              enum dma_data_direction dir)
{
    unsigned char *vaddr = *vaddr_handle;

    vaddr = (void *)get_unaligned((unsigned long *)(vaddr + size));

    if (dir == DMA_FROM_DEVICE)
        memcpy(vaddr, *vaddr_handle, size);

    hcd_buffer_free(bus, size + sizeof(vaddr), *vaddr_handle, *dma_handle);

    *vaddr_handle = vaddr;
    *dma_handle = 0;
}

void usb_hcd_unmap_urb_setup_for_dma(struct usb_hcd *hcd, struct urb *urb)
{
    if (urb->transfer_flags & URB_SETUP_MAP_SINGLE)
        dma_unmap_single(hcd->self.controller,
                         urb->setup_dma,
                         sizeof(struct usb_ctrlrequest),
                         DMA_TO_DEVICE);
    else if (urb->transfer_flags & URB_SETUP_MAP_LOCAL)
        hcd_free_coherent(urb->dev->bus,
                          &urb->setup_dma,
                          (void **) &urb->setup_packet,
                          sizeof(struct usb_ctrlrequest),
                          DMA_TO_DEVICE);

    /* Make it safe to call this routine more than once */
    urb->transfer_flags &= ~(URB_SETUP_MAP_SINGLE | URB_SETUP_MAP_LOCAL);
}

static void unmap_urb_for_dma(struct usb_hcd *hcd, struct urb *urb)
{
    if (hcd->driver->unmap_urb_for_dma)
        hcd->driver->unmap_urb_for_dma(hcd, urb);
    else
        usb_hcd_unmap_urb_for_dma(hcd, urb);
}

void usb_hcd_unmap_urb_for_dma(struct usb_hcd *hcd, struct urb *urb)
{
    enum dma_data_direction dir;

    usb_hcd_unmap_urb_setup_for_dma(hcd, urb);

    dir = usb_urb_dir_in(urb) ? DMA_FROM_DEVICE : DMA_TO_DEVICE;
    if (urb->transfer_flags & URB_DMA_MAP_SG)
        dma_unmap_sg(hcd->self.controller,
                     urb->sg,
                     urb->num_sgs,
                     dir);
    else if (urb->transfer_flags & URB_DMA_MAP_PAGE)
        dma_unmap_page(hcd->self.controller,
                       urb->transfer_dma,
                       urb->transfer_buffer_length,
                       dir);
    else if (urb->transfer_flags & URB_DMA_MAP_SINGLE)
        dma_unmap_single(hcd->self.controller,
                         urb->transfer_dma,
                         urb->transfer_buffer_length,
                         dir);
    else if (urb->transfer_flags & URB_MAP_LOCAL)
        hcd_free_coherent(urb->dev->bus,
                          &urb->transfer_dma,
                          &urb->transfer_buffer,
                          urb->transfer_buffer_length,
                          dir);

    /* Make it safe to call this routine more than once */
    urb->transfer_flags &= ~(URB_DMA_MAP_SG | URB_DMA_MAP_PAGE |
                             URB_DMA_MAP_SINGLE | URB_MAP_LOCAL);
}

static int map_urb_for_dma(struct usb_hcd *hcd, struct urb *urb,
                           gfp_t mem_flags)
{
    if (hcd->driver->map_urb_for_dma)
        return hcd->driver->map_urb_for_dma(hcd, urb, mem_flags);
    else
        return usb_hcd_map_urb_for_dma(hcd, urb, mem_flags);
}

int usb_hcd_map_urb_for_dma(struct usb_hcd *hcd, struct urb *urb,
                            gfp_t mem_flags)
{
    enum dma_data_direction dir;
    int ret = 0;

    /* Map the URB's buffers for DMA access.
     * Lower level HCD code should use *_dma exclusively,
     * unless it uses pio or talks to another transport,
     * or uses the provided scatter gather list for bulk.
     */

    if (usb_endpoint_xfer_control(&urb->ep->desc)) {
        if (hcd->self.uses_pio_for_control)
            return ret;
        if (hcd->self.uses_dma) {
            urb->setup_dma = dma_map_single(
                                 hcd->self.controller,
                                 urb->setup_packet,
                                 sizeof(struct usb_ctrlrequest),
                                 DMA_TO_DEVICE);
            if (dma_mapping_error(hcd->self.controller,
                                  urb->setup_dma))
                return -EAGAIN;
            urb->transfer_flags |= URB_SETUP_MAP_SINGLE;
        } else if (hcd->driver->flags & HCD_LOCAL_MEM) {
            ret = hcd_alloc_coherent(
                      urb->dev->bus, mem_flags,
                      &urb->setup_dma,
                      (void **)&urb->setup_packet,
                      sizeof(struct usb_ctrlrequest),
                      DMA_TO_DEVICE);
            if (ret)
                return ret;
            urb->transfer_flags |= URB_SETUP_MAP_LOCAL;
        }
    }

    dir = usb_urb_dir_in(urb) ? DMA_FROM_DEVICE : DMA_TO_DEVICE;
    if (urb->transfer_buffer_length != 0
            && !(urb->transfer_flags & URB_NO_TRANSFER_DMA_MAP)) {
        if (hcd->self.uses_dma) {
            if (urb->num_sgs) {
                int n = dma_map_sg(
                            hcd->self.controller,
                            urb->sg,
                            urb->num_sgs,
                            dir);
                if (n <= 0)
                    ret = -EAGAIN;
                else
                    urb->transfer_flags |= URB_DMA_MAP_SG;
                urb->num_mapped_sgs = n;
                if (n != urb->num_sgs)
                    urb->transfer_flags |=
                        URB_DMA_SG_COMBINED;
            } else if (urb->sg) {
                struct scatterlist *sg = urb->sg;
                urb->transfer_dma = dma_map_page(
                                        hcd->self.controller,
                                        sg_page(sg),
                                        sg->offset,
                                        urb->transfer_buffer_length,
                                        dir);
                if (dma_mapping_error(hcd->self.controller,
                                      urb->transfer_dma))
                    ret = -EAGAIN;
                else
                    urb->transfer_flags |= URB_DMA_MAP_PAGE;
            } else {
                urb->transfer_dma = dma_map_single(
                                        hcd->self.controller,
                                        urb->transfer_buffer,
                                        urb->transfer_buffer_length,
                                        dir);
                if (dma_mapping_error(hcd->self.controller,
                                      urb->transfer_dma))
                    ret = -EAGAIN;
                else
                    urb->transfer_flags |= URB_DMA_MAP_SINGLE;
            }
        } else if (hcd->driver->flags & HCD_LOCAL_MEM) {
            ret = hcd_alloc_coherent(
                      urb->dev->bus, mem_flags,
                      &urb->transfer_dma,
                      &urb->transfer_buffer,
                      urb->transfer_buffer_length,
                      dir);
            if (ret == 0)
                urb->transfer_flags |= URB_MAP_LOCAL;
        }
        if (ret && (urb->transfer_flags & (URB_SETUP_MAP_SINGLE |
                                           URB_SETUP_MAP_LOCAL)))
            usb_hcd_unmap_urb_for_dma(hcd, urb);
    }
    return ret;
}
#endif


/*-------------------------------------------------------------------------*/

/* may be called in any context with a valid urb->dev usecount
 * caller surrenders "ownership" of urb
 * expects usb_submit_urb() to have sanity checked and conditioned all
 * inputs in the urb
 */
int usb_hcd_submit_urb (struct urb *urb, gfp_t mem_flags)
{
    int         status;
    struct usb_hcd      *hcd;

    hcd = bus_to_hcd(urb->dev->bus);

    /* increment urb's reference count as part of giving it to the HCD
     * (which will control it).  HCD guarantees that it either returns
     * an error or calls giveback(), but not both.
     */
    usb_get_urb(urb);
    atomic_inc(&urb->use_count);
    atomic_inc(&urb->dev->urbnum);
    usbmon_urb_submit(&hcd->self, urb);

    /* NOTE requirements on root-hub callers (usbfs and the hub
     * driver, for now):  URBs' urb->transfer_buffer must be
     * valid and usb_buffer_{sync,unmap}() not be needed, since
     * they could clobber root hub response data.  Also, control
     * URBs must be submitted in process context with interrupts
     * enabled.
     */

    if (is_root_hub(urb->dev)) {
        status = rh_urb_enqueue(hcd, urb);
    } else {
        status = map_urb_for_dma(hcd, urb, mem_flags);
        if (likely(status == 0)) {
            status = hcd->driver->urb_enqueue(hcd, urb, mem_flags);
            if (unlikely(status))
                unmap_urb_for_dma(hcd, urb);
        }
    }

