OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    if (unlikely(status)) {
        usbmon_urb_submit_error(&hcd->self, urb, status);
        urb->hcpriv = NULL;
        INIT_LIST_HEAD(&urb->urb_list);
        atomic_dec(&urb->use_count);
        atomic_dec(&urb->dev->urbnum);
        //if (atomic_read(&urb->reject))
        //  wake_up(&usb_kill_urb_queue);
        usb_put_urb(urb);
    }
    return status;
}

/*-------------------------------------------------------------------------*/

/* this makes the hcd giveback() the urb more quickly, by kicking it
 * off hardware queues (which may take a while) and returning it as
 * soon as practical.  we've already set up the urb's return status,
 * but we can't know if the callback completed already.
 */
static int unlink1(struct usb_hcd *hcd, struct urb *urb, int status)
{
    int     value;

    if (is_root_hub(urb->dev))
        value = usb_rh_urb_dequeue(hcd, urb, status);
    else {

        /* The only reason an HCD might fail this call is if
         * it has not yet fully queued the urb to begin with.
         * Such failures should be harmless. */
        value = hcd->driver->urb_dequeue(hcd, urb, status);
    }
    return value;
}

/*
 * called in any context
 *
 * caller guarantees urb won't be recycled till both unlink()
 * and the urb's completion function return
 */
int usb_hcd_unlink_urb (struct urb *urb, int status)
{
    struct usb_hcd      *hcd;
    int         retval = -EIDRM;
    //unsigned long     flags;

    /* Prevent the device and bus from going away while
     * the unlink is carried out.  If they are already gone
     * then urb->use_count must be 0, since disconnected
     * devices can't have any active URBs.
     */
    spin_lock_irqsave(&hcd_urb_unlink_lock, flags);
    if (atomic_read(&urb->use_count) > 0) {
        retval = 0;
        usb_get_dev(urb->dev);
    }
    spin_unlock_irqrestore(&hcd_urb_unlink_lock, flags);
    if (retval == 0) {
        hcd = bus_to_hcd(urb->dev->bus);
        retval = unlink1(hcd, urb, status);
        usb_put_dev(urb->dev);
    }

    if (retval == 0)
        retval = -EINPROGRESS;
    else if (retval != -EIDRM && retval != -EBUSY)
        USB_debug("hcd_unlink_urb %p fail %d\n", urb, retval);
    return retval;
}

/*-------------------------------------------------------------------------*/

/**
 * usb_hcd_giveback_urb - return URB from HCD to device driver
 * @hcd: host controller returning the URB
 * @urb: urb being returned to the USB device driver.
 * @status: completion status code for the URB.
 * Context: in_interrupt()
 *
 * This hands the URB from HCD to its USB device driver, using its
 * completion function.  The HCD has freed all per-urb resources
 * (and is done using urb->hcpriv).  It also released all HCD locks;
 * the device driver won't cause problems if it frees, modifies,
 * or resubmits this URB.
 *
 * If @urb was unlinked, the value of @status will be overridden by
 * @urb->unlinked.  Erroneous short transfers are detected in case
 * the HCD hasn't checked for them.
 */
void usb_hcd_giveback_urb(struct usb_hcd *hcd, struct urb *urb, int status)
{
    urb->hcpriv = NULL;
    if (unlikely(urb->unlinked))
        status = urb->unlinked;
    else if (unlikely((urb->transfer_flags & URB_SHORT_NOT_OK) &&
                      urb->actual_length < urb->transfer_buffer_length &&
                      !status))
        status = -EREMOTEIO;

    unmap_urb_for_dma(hcd, urb);
    usbmon_urb_complete(&hcd->self, urb, status);
    usb_unanchor_urb(urb);

    /* pass ownership to the completion handler */
    urb->status = status;
    urb->complete (urb);
    atomic_dec (&urb->use_count);
    //if (unlikely(atomic_read(&urb->reject)))
    //  wake_up (&usb_kill_urb_queue);
#if 0   // Nuvoton removed  
    usb_put_urb (urb);
#endif
}

/*-------------------------------------------------------------------------*/

/* Cancel all URBs pending on this endpoint and wait for the endpoint's
 * queue to drain completely.  The caller must first insure that no more
 * URBs can be submitted for this endpoint.
 */
void usb_hcd_flush_endpoint(struct usb_device *udev,
                            struct usb_host_endpoint *ep)
{
    struct usb_hcd      *hcd;
    struct urb      *urb;

    if (!ep)
        return;
    might_sleep();
    hcd = bus_to_hcd(udev->bus);

    /* No more submits can occur */
    spin_lock_irq(&hcd_urb_list_lock);
rescan:
    //list_for_each_entry (urb, &ep->urb_list, urb_list) {
    for (urb = list_entry((&ep->urb_list)->next, struct urb, urb_list);
            &urb->urb_list != (&ep->urb_list);
            urb = list_entry(urb->urb_list.next, struct urb, urb_list)) {
        //int   is_in;

        if (urb->unlinked)
            continue;
        usb_get_urb (urb);
        //is_in = usb_urb_dir_in(urb);
        spin_unlock(&hcd_urb_list_lock);

        /* kick hcd */
        unlink1(hcd, urb, -ESHUTDOWN);
#if 0
        USB_debug("shutdown urb %p ep%d%s%s\n", urb, usb_endpoint_num(&ep->desc), is_in ? "in" : "out",
                  ({  char *s;

                      switch (usb_endpoint_type(&ep->desc))
    {
    case USB_ENDPOINT_XFER_CONTROL:
        s = "";
        break;
    case USB_ENDPOINT_XFER_BULK:
        s = "-bulk";
        break;
    case USB_ENDPOINT_XFER_INT:
        s = "-intr";
        break;
    default:
        s = "-iso";
        break;
    };
    s;
               }));
#endif
        usb_put_urb (urb);

        /* list contents may have changed */
        spin_lock(&hcd_urb_list_lock);
        goto rescan;
    }
    spin_unlock_irq(&hcd_urb_list_lock);

    /* Wait until the endpoint queue is completely empty */
    while (!list_empty (&ep->urb_list)) {
        spin_lock_irq(&hcd_urb_list_lock);

        /* The list may have changed while we acquired the spinlock */
        urb = NULL;
        if (!list_empty (&ep->urb_list)) {
            urb = list_entry (ep->urb_list.prev, struct urb,
                              urb_list);
            usb_get_urb (urb);
        }
        spin_unlock_irq(&hcd_urb_list_lock);

        if (urb) {
            usb_kill_urb (urb);
            usb_put_urb (urb);
        }
    }
}

/**
 * usb_hcd_alloc_bandwidth - check whether a new bandwidth setting exceeds
 *              the bus bandwidth
 * @udev: target &usb_device
 * @new_config: new configuration to install
 * @cur_alt: the current alternate interface setting
 * @new_alt: alternate interface setting that is being installed
 *
 * To change configurations, pass in the new configuration in new_config,
 * and pass NULL for cur_alt and new_alt.
 *
 * To reset a device's configuration (put the device in the ADDRESSED state),
 * pass in NULL for new_config, cur_alt, and new_alt.
 *
 * To change alternate interface settings, pass in NULL for new_config,
 * pass in the current alternate interface setting in cur_alt,
 * and pass in the new alternate interface setting in new_alt.
 *
 * Returns an error if the requested bandwidth change exceeds the
 * bus bandwidth or host controller internal resources.
 */
int usb_hcd_alloc_bandwidth(struct usb_device *udev,
                            struct usb_host_config *new_config,
                            struct usb_host_interface *cur_alt,
                            struct usb_host_interface *new_alt)
{
    int num_intfs, i, j;
    struct usb_host_interface *alt = NULL;
    int ret = 0;
    struct usb_hcd *hcd;
    struct usb_host_endpoint *ep;

    hcd = bus_to_hcd(udev->bus);
    if (!hcd->driver->check_bandwidth)
        return 0;

    /* Configuration is being removed - set configuration 0 */
    if (!new_config && !cur_alt) {
        for (i = 1; i < 16; ++i) {
            ep = udev->ep_out[i];
            if (ep)
                hcd->driver->drop_endpoint(hcd, udev, ep);
            ep = udev->ep_in[i];
            if (ep)
                hcd->driver->drop_endpoint(hcd, udev, ep);
        }
        hcd->driver->check_bandwidth(hcd, udev);
        return 0;
    }
    /* Check if the HCD says there's enough bandwidth.  Enable all endpoints
     * each interface's alt setting 0 and ask the HCD to check the bandwidth
     * of the bus.  There will always be bandwidth for endpoint 0, so it's
     * ok to exclude it.
     */
    if (new_config) {
        num_intfs = new_config->desc.bNumInterfaces;
        /* Remove endpoints (except endpoint 0, which is always on the
         * schedule) from the old config from the schedule
         */
        for (i = 1; i < 16; ++i) {
            ep = udev->ep_out[i];
            if (ep) {
                ret = hcd->driver->drop_endpoint(hcd, udev, ep);
                if (ret < 0)
                    goto reset;
            }
            ep = udev->ep_in[i];
            if (ep) {
                ret = hcd->driver->drop_endpoint(hcd, udev, ep);
                if (ret < 0)
                    goto reset;
            }
        }
        for (i = 0; i < num_intfs; ++i) {
            struct usb_host_interface *first_alt;
            int iface_num;

            first_alt = &new_config->intf_cache[i]->altsetting[0];
            iface_num = first_alt->desc.bInterfaceNumber;
            /* Set up endpoints for alternate interface setting 0 */
            alt = usb_find_alt_setting(new_config, iface_num, 0);
            if (!alt)
                /* No alt setting 0? Pick the first setting. */
                alt = first_alt;

            for (j = 0; j < alt->desc.bNumEndpoints; j++) {
                ret = hcd->driver->add_endpoint(hcd, udev, &alt->endpoint[j]);
                if (ret < 0)
                    goto reset;
            }
        }
    }
    if (cur_alt && new_alt) {
        struct usb_interface *iface = usb_ifnum_to_if(udev,
                                      cur_alt->desc.bInterfaceNumber);

