OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
        if (!iface)
            return -EINVAL;
        if (iface->resetting_device) {
            /*
             * The USB core just reset the device, so the xHCI host
             * and the device will think alt setting 0 is installed.
             * However, the USB core will pass in the alternate
             * setting installed before the reset as cur_alt.  Dig
             * out the alternate setting 0 structure, or the first
             * alternate setting if a broken device doesn't have alt
             * setting 0.
             */
            cur_alt = usb_altnum_to_altsetting(iface, 0);
            if (!cur_alt)
                cur_alt = &iface->altsetting[0];
        }

        /* Drop all the endpoints in the current alt setting */
        for (i = 0; i < cur_alt->desc.bNumEndpoints; i++) {
            ret = hcd->driver->drop_endpoint(hcd, udev,
                                             &cur_alt->endpoint[i]);
            if (ret < 0)
                goto reset;
        }
        /* Add all the endpoints in the new alt setting */
        for (i = 0; i < new_alt->desc.bNumEndpoints; i++) {
            ret = hcd->driver->add_endpoint(hcd, udev,
                                            &new_alt->endpoint[i]);
            if (ret < 0)
                goto reset;
        }
    }
    ret = hcd->driver->check_bandwidth(hcd, udev);
reset:
    if (ret < 0)
        hcd->driver->reset_bandwidth(hcd, udev);
    return ret;
}

/* Disables the endpoint: synchronizes with the hcd to make sure all
 * endpoint state is gone from hardware.  usb_hcd_flush_endpoint() must
 * have been called previously.  Use for set_configuration, set_interface,
 * driver removal, physical disconnect.
 *
 * example:  a qh stored in ep->hcpriv, holding state related to endpoint
 * type, maxpacket size, toggle, halt status, and scheduling.
 */
void usb_hcd_disable_endpoint(struct usb_device *udev,
                              struct usb_host_endpoint *ep)
{
    struct usb_hcd      *hcd;

    might_sleep();
    hcd = bus_to_hcd(udev->bus);
    if (hcd->driver->endpoint_disable)
        hcd->driver->endpoint_disable(hcd, ep);
}

/**
 * usb_hcd_reset_endpoint - reset host endpoint state
 * @udev: USB device.
 * @ep:   the endpoint to reset.
 *
 * Resets any host endpoint state such as the toggle bit, sequence
 * number and current window.
 */
void usb_hcd_reset_endpoint(struct usb_device *udev,
                            struct usb_host_endpoint *ep)
{
    struct usb_hcd *hcd;

    hcd = bus_to_hcd(udev->bus);

    if (hcd->driver->endpoint_reset)
        hcd->driver->endpoint_reset(hcd, ep);
    else {
        int epnum = usb_endpoint_num(&ep->desc);
        int is_out = usb_endpoint_dir_out(&ep->desc);
        int is_control = usb_endpoint_xfer_control(&ep->desc);

        usb_settoggle(udev, epnum, is_out, 0);
        if (is_control)
            usb_settoggle(udev, epnum, !is_out, 0);
    }
}

/**
 * usb_alloc_streams - allocate bulk endpoint stream IDs.
 * @interface:      alternate setting that includes all endpoints.
 * @eps:        array of endpoints that need streams.
 * @num_eps:        number of endpoints in the array.
 * @num_streams:    number of streams to allocate.
 * @mem_flags:      flags hcd should use to allocate memory.
 *
 * Sets up a group of bulk endpoints to have num_streams stream IDs available.
 * Drivers may queue multiple transfers to different stream IDs, which may
 * complete in a different order than they were queued.
 */
int usb_alloc_streams(struct usb_interface *interface,
                      struct usb_host_endpoint **eps, unsigned int num_eps,
                      unsigned int num_streams, gfp_t mem_flags)
{
    struct usb_hcd *hcd;
    struct usb_device *dev;
    int i;

    dev = interface_to_usbdev(interface);
    hcd = bus_to_hcd(dev->bus);
    if (!hcd->driver->alloc_streams || !hcd->driver->free_streams)
        return -EINVAL;
    if (dev->speed != USB_SPEED_SUPER)
        return -EINVAL;

    /* Streams only apply to bulk endpoints. */
    for (i = 0; i < num_eps; i++)
        if (!usb_endpoint_xfer_bulk(&eps[i]->desc))
            return -EINVAL;

    return hcd->driver->alloc_streams(hcd, dev, eps, num_eps,
                                      num_streams, mem_flags);
}

/**
 * usb_free_streams - free bulk endpoint stream IDs.
 * @interface:  alternate setting that includes all endpoints.
 * @eps:    array of endpoints to remove streams from.
 * @num_eps:    number of endpoints in the array.
 * @mem_flags:  flags hcd should use to allocate memory.
 *
 * Reverts a group of bulk endpoints back to not using stream IDs.
 * Can fail if we are given bad arguments, or HCD is broken.
 */
void usb_free_streams(struct usb_interface *interface,
                      struct usb_host_endpoint **eps, unsigned int num_eps,
                      gfp_t mem_flags)
{
    struct usb_hcd *hcd;
    struct usb_device *dev;
    int i;

    dev = interface_to_usbdev(interface);
    hcd = bus_to_hcd(dev->bus);
    if (dev->speed != USB_SPEED_SUPER)
        return;

    /* Streams only apply to bulk endpoints. */
    for (i = 0; i < num_eps; i++)
        if (!eps[i] || !usb_endpoint_xfer_bulk(&eps[i]->desc))
            return;

    hcd->driver->free_streams(hcd, dev, eps, num_eps, mem_flags);
}

/* Protect against drivers that try to unlink URBs after the device
 * is gone, by waiting until all unlinks for @udev are finished.
 * Since we don't currently track URBs by device, simply wait until
 * nothing is running in the locked region of usb_hcd_unlink_urb().
 */
void usb_hcd_synchronize_unlinks(struct usb_device *udev)
{
    spin_lock_irq(&hcd_urb_unlink_lock);
    spin_unlock_irq(&hcd_urb_unlink_lock);
}

/*-------------------------------------------------------------------------*/

/* called in any context */
int usb_hcd_get_frame_number (struct usb_device *udev)
{
    struct usb_hcd  *hcd;

    hcd = bus_to_hcd(udev->bus);

    if (!HCD_RH_RUNNING(hcd))
        return -ESHUTDOWN;
    return hcd->driver->get_frame_number (hcd);
}

/*-------------------------------------------------------------------------*/

#ifdef  CONFIG_PM

int hcd_bus_suspend(struct usb_device *rhdev, pm_message_t msg)
{
    struct usb_hcd  *hcd;
    int     status;
    int     old_state;

    hcd = container_of(rhdev->bus, struct usb_hcd, self);
    old_state = hcd->state;

    USB_debug("bus %ssuspend, wakeup %d\n", (PMSG_IS_AUTO(msg) ? "auto-" : ""), rhdev->do_remote_wakeup);
    if (HCD_DEAD(hcd)) {
        USB_debug("skipped %s of dead bus\n", "suspend");
        return 0;
    }

    if (!hcd->driver->bus_suspend) {
        status = -ENOENT;
    } else {
        clear_bit(HCD_FLAG_RH_RUNNING, &hcd->flags);
        hcd->state = HC_STATE_QUIESCING;
        status = hcd->driver->bus_suspend(hcd);
    }
    if (status == 0) {
        usb_set_device_state(rhdev, USB_STATE_SUSPENDED);
        hcd->state = HC_STATE_SUSPENDED;
    } else {
        spin_lock_irq(&hcd_root_hub_lock);
        if (!HCD_DEAD(hcd)) {
            set_bit(HCD_FLAG_RH_RUNNING, &hcd->flags);
            hcd->state = old_state;
        }
        spin_unlock_irq(&hcd_root_hub_lock);
        USB_debug("bus %s fail, err %d\n", "suspend", status);
    }
    return status;
}

int hcd_bus_resume(struct usb_device *rhdev, pm_message_t msg)
{
    struct usb_hcd  *hcd;
    int     status;
    int     old_state;

    hcd = container_of(rhdev->bus, struct usb_hcd, self);
    old_state = hcd->state;

    USB_debug("usb %sresume\n", (PMSG_IS_AUTO(msg) ? "auto-" : ""));
    if (HCD_DEAD(hcd)) {
        USB_debug("skipped %s of dead bus\n", "resume");
        return 0;
    }
    if (!hcd->driver->bus_resume)
        return -ENOENT;
    if (HCD_RH_RUNNING(hcd))
        return 0;

