OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    hcd->state = HC_STATE_RESUMING;
    status = hcd->driver->bus_resume(hcd);
    clear_bit(HCD_FLAG_WAKEUP_PENDING, &hcd->flags);
    if (status == 0) {
        /* TRSMRCY = 10 msec */
        msleep(10);
        spin_lock_irq(&hcd_root_hub_lock);
        if (!HCD_DEAD(hcd)) {
            usb_set_device_state(rhdev, rhdev->actconfig
                                 ? USB_STATE_CONFIGURED
                                 : USB_STATE_ADDRESS);
            set_bit(HCD_FLAG_RH_RUNNING, &hcd->flags);
            hcd->state = HC_STATE_RUNNING;
        }
        spin_unlock_irq(&hcd_root_hub_lock);
    } else {
        hcd->state = old_state;
        USB_debug("bus %s fail, err %d\n", "resume", status);
        if (status != -ESHUTDOWN)
            usb_hc_died(hcd);
    }
    return status;
}

#endif  /* CONFIG_PM */

#ifdef  CONFIG_USB_SUSPEND

/* Workqueue routine for root-hub remote wakeup */
static void hcd_resume_work(struct work_struct *work)
{
    struct usb_hcd *hcd;
    struct usb_device *udev;

    hcd = container_of(work, struct usb_hcd, wakeup_work);
    udev = hcd->self.root_hub;

    usb_lock_device(udev);
    usb_remote_wakeup(udev);
    usb_unlock_device(udev);
}

/**
 * usb_hcd_resume_root_hub - called by HCD to resume its root hub
 * @hcd: host controller for this root hub
 *
 * The USB host controller calls this function when its root hub is
 * suspended (with the remote wakeup feature enabled) and a remote
 * wakeup request is received.  The routine submits a workqueue request
 * to resume the root hub (that is, manage its downstream ports again).
 */
void usb_hcd_resume_root_hub (struct usb_hcd *hcd)
{
    unsigned long flags;

    spin_lock_irqsave (&hcd_root_hub_lock, flags);
    if (hcd->rh_registered) {
        set_bit(HCD_FLAG_WAKEUP_PENDING, &hcd->flags);
        queue_work(pm_wq, &hcd->wakeup_work);
    }
    spin_unlock_irqrestore (&hcd_root_hub_lock, flags);
}

#endif  /* CONFIG_USB_SUSPEND */

/*-------------------------------------------------------------------------*/

#ifdef  CONFIG_USB_OTG

/**
 * usb_bus_start_enum - start immediate enumeration (for OTG)
 * @bus: the bus (must use hcd framework)
 * @port_num: 1-based number of port; usually bus->otg_port
 * Context: in_interrupt()
 *
 * Starts enumeration, with an immediate reset followed later by
 * khubd identifying and possibly configuring the device.
 * This is needed by OTG controller drivers, where it helps meet
 * HNP protocol timing requirements for starting a port reset.
 */
int usb_bus_start_enum(struct usb_bus *bus, unsigned port_num)
{
    struct usb_hcd      *hcd;
    int         status = -EOPNOTSUPP;

    /* NOTE: since HNP can't start by grabbing the bus's address0_sem,
     * boards with root hubs hooked up to internal devices (instead of
     * just the OTG port) may need more attention to resetting...
     */
    hcd = container_of (bus, struct usb_hcd, self);
    if (port_num && hcd->driver->start_port_reset)
        status = hcd->driver->start_port_reset(hcd, port_num);

    /* run khubd shortly after (first) root port reset finishes;
     * it may issue others, until at least 50 msecs have passed.
     */
    //if (status == 0)
    //  mod_timer(&hcd->rh_timer, jiffies + msecs_to_jiffies(10));
    return status;
}

#endif

/*-------------------------------------------------------------------------*/

/**
 * usb_hcd_irq - hook IRQs to HCD framework (bus glue)
 * @irq: the IRQ being raised
 * @__hcd: pointer to the HCD whose IRQ is being signaled
 *
 * If the controller isn't HALTed, calls the driver's irq handler.
 * Checks whether the controller is now dead.
 */
#if 0
irqreturn_t usb_hcd_irq (int irq, void *__hcd)
{
    struct usb_hcd      *hcd = __hcd;
    unsigned long       flags;
    irqreturn_t     rc;

    /* IRQF_DISABLED doesn't work correctly with shared IRQs
     * when the first handler doesn't use it.  So let's just
     * assume it's never used.
     */
    local_irq_save(flags);

    if (unlikely(HCD_DEAD(hcd) || !HCD_HW_ACCESSIBLE(hcd))) {
        rc = IRQ_NONE;
    } else if (hcd->driver->irq(hcd) == IRQ_NONE) {
        rc = IRQ_NONE;
    } else {
        set_bit(HCD_FLAG_SAW_IRQ, &hcd->flags);
        if (hcd->shared_hcd)
            set_bit(HCD_FLAG_SAW_IRQ, &hcd->shared_hcd->flags);
        rc = IRQ_HANDLED;
    }

    local_irq_restore(flags);
    return rc;
}
#endif

/*-------------------------------------------------------------------------*/

/**
 * usb_hc_died - report abnormal shutdown of a host controller (bus glue)
 * @hcd: pointer to the HCD representing the controller
 *
 * This is called by bus glue to report a USB host controller that died
 * while operations may still have been pending.  It's called automatically
 * by the PCI glue, so only glue for non-PCI busses should need to call it.
 *
 * Only call this function with the primary HCD.
 */
void usb_hc_died (struct usb_hcd *hcd)
{
    //unsigned long flags;

    USB_error("HC died; cleaning up\n");

    spin_lock_irqsave (&hcd_root_hub_lock, flags);
    clear_bit(HCD_FLAG_RH_RUNNING, &hcd->flags);
    set_bit(HCD_FLAG_DEAD, &hcd->flags);
    if (hcd->rh_registered) {
        clear_bit(HCD_FLAG_POLL_RH, &hcd->flags);

        /* make khubd clean up old urbs and devices */
        usb_set_device_state (hcd->self.root_hub,
                              USB_STATE_NOTATTACHED);
        usb_kick_khubd (hcd->self.root_hub);
    }
    if (usb_hcd_is_primary_hcd(hcd) && hcd->shared_hcd) {
        hcd = hcd->shared_hcd;
        if (hcd->rh_registered) {
            clear_bit(HCD_FLAG_POLL_RH, &hcd->flags);

            /* make khubd clean up old urbs and devices */
            usb_set_device_state(hcd->self.root_hub,
                                 USB_STATE_NOTATTACHED);
            usb_kick_khubd(hcd->self.root_hub);
        }
    }
    spin_unlock_irqrestore (&hcd_root_hub_lock, flags);
    /* Make sure that the other roothub is also deallocated. */
}

/*-------------------------------------------------------------------------*/

/**
 * usb_create_shared_hcd - create and initialize an HCD structure
 * @driver: HC driver that will use this hcd
 * @dev: device for this HC, stored in hcd->self.controller
 * @bus_name: value to store in hcd->self.bus_name
 * @primary_hcd: a pointer to the usb_hcd structure that is sharing the
 *              PCI device.  Only allocate certain resources for the primary HCD
 * Context: !in_interrupt()
 *
 * Allocate a struct usb_hcd, with extra space at the end for the
 * HC driver's private data.  Initialize the generic members of the
 * hcd structure.
 *
 * If memory is unavailable, returns NULL.
 */
struct usb_hcd *usb_create_shared_hcd(const struct hc_driver *driver,
                                      struct device *dev, const char *bus_name,
                                      struct usb_hcd *primary_hcd)
{
    struct usb_hcd *hcd;

    hcd = kzalloc(sizeof(*hcd) + driver->hcd_priv_size+8, GFP_KERNEL);
    if (!hcd) {
        USB_debug("hcd alloc failed\n");
        return NULL;
    }
    hcd->hcd_priv = (void *)((__u32)hcd + sizeof(*hcd));

    if (primary_hcd == NULL) {
        dev_set_drvdata(dev, hcd);
    } else {
        hcd->primary_hcd = primary_hcd;
        primary_hcd->primary_hcd = primary_hcd;
        hcd->shared_hcd = primary_hcd;
        primary_hcd->shared_hcd = hcd;
    }

    hcd->kref = 0;

    usb_bus_init(&hcd->self);
    hcd->self.controller = dev;
    hcd->self.bus_name = bus_name;

    usb_add_poll_hcd(hcd);  // Nuvoton ported ...

#ifdef CONFIG_USB_SUSPEND
    INIT_WORK(&hcd->wakeup_work, hcd_resume_work);
#endif

