OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    hcd->driver = driver;
    hcd->speed = driver->flags & HCD_MASK;
    hcd->product_desc = (driver->product_desc) ? driver->product_desc :
                        "USB Host Controller";
    return hcd;
}

/**
 * usb_create_hcd - create and initialize an HCD structure
 * @driver: HC driver that will use this hcd
 * @dev: device for this HC, stored in hcd->self.controller
 * @bus_name: value to store in hcd->self.bus_name
 * Context: !in_interrupt()
 *
 * Allocate a struct usb_hcd, with extra space at the end for the
 * HC driver's private data.  Initialize the generic members of the
 * hcd structure.
 *
 * If memory is unavailable, returns NULL.
 */
struct usb_hcd *usb_create_hcd(const struct hc_driver *driver,
                               struct device *dev, const char *bus_name)
{
    return usb_create_shared_hcd(driver, dev, bus_name, NULL);
}

struct usb_hcd *usb_get_hcd (struct usb_hcd *hcd)
{
    if (hcd)
        hcd->kref ++;
    return hcd;
}

void usb_put_hcd (struct usb_hcd *hcd)
{
    if (hcd) {
        hcd->kref--;
    }
}

int usb_hcd_is_primary_hcd(struct usb_hcd *hcd)
{
    if (!hcd->primary_hcd)
        return 1;
    return hcd == hcd->primary_hcd;
}

/**
 * usb_add_hcd - finish generic HCD structure initialization and register
 * @hcd: the usb_hcd structure to initialize
 * @irqnum: Interrupt line to allocate
 * @irqflags: Interrupt type flags
 *
 * Finish the remaining parts of generic HCD initialization: allocate the
 * buffers of consistent memory, register the bus, request the IRQ line,
 * and call the driver's reset() and start() routines.
 */
int usb_add_hcd(struct usb_hcd *hcd,
                unsigned int irqnum, unsigned long irqflags)
{
    int retval;
    struct usb_device *rhdev;

    USB_debug("usb_add_hcd - %s\n", hcd->product_desc);

    /* Keep old behaviour if authorized_default is not in [0, 1]. */
    if (authorized_default < 0 || authorized_default > 1)
        hcd->authorized_default = hcd->wireless? 0 : 1;
    else
        hcd->authorized_default = authorized_default;
    set_bit(HCD_FLAG_HW_ACCESSIBLE, &hcd->flags);

    /* HC is in reset state, but accessible.  Now do the one-time init,
     * bottom up so that hcds can customize the root hubs before khubd
     * starts talking to them.  (Note, bus id is assigned early too.)
     */
    //if ((retval = hcd_buffer_create(hcd)) != 0) {
    //  USB_debug("pool alloc failed\n");
    //  return retval;
    //}

    if ((retval = usb_register_bus(&hcd->self)) < 0)
        goto err_register_bus;

    if ((rhdev = usb_alloc_dev(NULL, &hcd->self, 0)) == NULL) {
        USB_error("unable to allocate root hub\n");
        retval = -ENOMEM;
        goto err_allocate_root_hub;
    }
    hcd->self.root_hub = rhdev;

    switch (hcd->speed) {
    case HCD_USB11:
        rhdev->speed = USB_SPEED_FULL;
        break;
    case HCD_USB2:
        rhdev->speed = USB_SPEED_HIGH;
        break;
    case HCD_USB3:
        rhdev->speed = USB_SPEED_SUPER;
        break;
    default:
        retval = -EINVAL;
        goto err_set_rh_speed;
    }

    /* wakeup flag init defaults to "everything works" for root hubs,
     * but drivers can override it in reset() if needed, along with
     * recording the overall controller's system wakeup capability.
     */
    //device_set_wakeup_capable(&rhdev->dev, 1);

    /* HCD_FLAG_RH_RUNNING doesn't matter until the root hub is
     * registered.  But since the controller can die at any time,
     * let's initialize the flag before touching the hardware.
     */
    set_bit(HCD_FLAG_RH_RUNNING, &hcd->flags);

    /* "reset" is misnamed; its role is now one-time init. the controller
     * should already have been reset (and boot firmware kicked off etc).
     */
    if (hcd->driver->reset && (retval = hcd->driver->reset(hcd)) < 0) {
        USB_error("can't setup\n");
        goto err_hcd_driver_setup;
    }
    hcd->rh_pollable = 1;

    /* NOTE: root hub and controller capabilities may not be the same */
    //if (device_can_wakeup(hcd->self.controller)
    //      && device_can_wakeup(&hcd->self.root_hub->dev))
    //  USB_debug("supports USB remote wakeup\n");

    hcd->state = HC_STATE_RUNNING;
    retval = hcd->driver->start(hcd);
    if (retval < 0) {
        USB_error("startup error %d\n", retval);
        goto err_hcd_driver_start;
    }

    /* starting here, usbcore will pay attention to this root hub */
    rhdev->bus_mA = min(500u, hcd->power_budget);
    if ((retval = register_root_hub(hcd)) != 0)
        goto err_register_root_hub;

    if (hcd->uses_new_polling && HCD_POLL_RH(hcd))
        usb_hcd_poll_rh_status(hcd);

    /*
     * Host controllers don't generate their own wakeup requests;
     * they only forward requests from the root hub.  Therefore
     * controllers should always be enabled for remote wakeup.
     */
    //device_wakeup_enable(hcd->self.controller);
    return retval;

err_register_root_hub:
    hcd->rh_pollable = 0;
    clear_bit(HCD_FLAG_POLL_RH, &hcd->flags);
    hcd->driver->stop(hcd);
    hcd->state = HC_STATE_HALT;
    clear_bit(HCD_FLAG_POLL_RH, &hcd->flags);
err_hcd_driver_start:
err_hcd_driver_setup:
err_set_rh_speed:
    usb_put_dev(hcd->self.root_hub);
err_allocate_root_hub:
    usb_deregister_bus(&hcd->self);
err_register_bus:
    return retval;
}

/**
 * usb_remove_hcd - shutdown processing for generic HCDs
 * @hcd: the usb_hcd structure to remove
 * Context: !in_interrupt()
 *
 * Disconnects the root hub, then reverses the effects of usb_add_hcd(),
 * invoking the HCD's stop() method.
 */
void usb_remove_hcd(struct usb_hcd *hcd)
{
    struct usb_device *rhdev;

    rhdev = hcd->self.root_hub;

    USB_vdebug("remove, state %x\n", hcd->state);

    usb_get_dev(rhdev);
    //sysfs_remove_group(&rhdev->dev.kobj, &usb_bus_attr_group);

    clear_bit(HCD_FLAG_RH_RUNNING, &hcd->flags);
    if (HC_IS_RUNNING (hcd->state))
        hcd->state = HC_STATE_QUIESCING;

    USB_debug("roothub graceful disconnect\n");
    spin_lock_irq (&hcd_root_hub_lock);
    hcd->rh_registered = 0;
    spin_unlock_irq (&hcd_root_hub_lock);

#ifdef CONFIG_USB_SUSPEND
    cancel_work_sync(&hcd->wakeup_work);
#endif

