OpenNuvoton/M480BSP/Library/USB_Host/src_core/hcd.c
    mutex_lock(&usb_bus_list_lock);
    usb_disconnect(&rhdev);     /* Sets rhdev to NULL */
    mutex_unlock(&usb_bus_list_lock);

    /* Prevent any more root-hub status calls from the timer.
     * The HCD might still restart the timer (if a port status change
     * interrupt occurs), but usb_hcd_poll_rh_status() won't invoke
     * the hub_status_data() callback.
     */
    hcd->rh_pollable = 0;
    clear_bit(HCD_FLAG_POLL_RH, &hcd->flags);
    //del_timer_sync(&hcd->rh_timer);

    hcd->driver->stop(hcd);
    hcd->state = HC_STATE_HALT;

    /* In case the HCD restarted the timer, stop it again. */
    clear_bit(HCD_FLAG_POLL_RH, &hcd->flags);
    //del_timer_sync(&hcd->rh_timer);

    //if (usb_hcd_is_primary_hcd(hcd)) {
    //  if (hcd->irq >= 0)
    //      free_irq(hcd->irq, hcd);
    //}

    usb_put_dev(hcd->self.root_hub);
    usb_deregister_bus(&hcd->self);
    //hcd_buffer_destroy(hcd);
}

#if 0
void
usb_hcd_platform_shutdown(struct platform_device* dev)
{
    struct usb_hcd *hcd;

    hcd = platform_get_drvdata(dev);

    if (hcd->driver->shutdown)
        hcd->driver->shutdown(hcd);
}
#endif

/*-------------------------------------------------------------------------*/

#if defined(CONFIG_USB_MON) || defined(CONFIG_USB_MON_MODULE)

struct usb_mon_operations *mon_ops;

/*
 * The registration is unlocked.
 * We do it this way because we do not want to lock in hot paths.
 *
 * Notice that the code is minimally error-proof. Because usbmon needs
 * symbols from usbcore, usbcore gets referenced and cannot be unloaded first.
 */

int usb_mon_register (struct usb_mon_operations *ops)
{

    if (mon_ops)
        return -EBUSY;

    mon_ops = ops;
    mb();
    return 0;
}

void usb_mon_deregister (void)
{

    if (mon_ops == NULL) {
        printk(KERN_ERR "USB: monitor was not registered\n");
        return;
    }
    mon_ops = NULL;
    mb();
}

#endif /* CONFIG_USB_MON || CONFIG_USB_MON_MODULE */


/// @endcond HIDDEN_SYMBOLS
